app/views/statuses/_feed.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
		<a href="/<%= status.user.username rescue ""%>">
		<% if status.user and !status.user.photo.blank? %>