app/views/users/_feed.html.erb

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 2 LIMIT 1
---
		<% if activity.status_id %>
			<% @status = Status.find(activity.status_id) rescue nil%>

SELECT `follows`.* FROM `follows` WHERE (user_id = 1 and follow_id = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (username LIKE 'chris') LIMIT 1
---
		<% elsif activity.follow_id %>
			<% @follow = Follow.find(activity.follow_id) rescue nil %>
			<% @followed = User.find(@follow.follow_id) rescue nil%>