app/views/follows/_follows.html.erb

SELECT `follows`.* FROM `follows` WHERE (user_id = 1 and follow_id = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (username LIKE 'john') LIMIT 1
---
	<% if params[:view] == 'following'%>
		<% @followuser = User.find(follow.follow_id) rescue nil%><br/>

SELECT `follows`.* FROM `follows` WHERE (follow_id = 11) ORDER BY updated_at DESC LIMIT 30 OFFSET 0
---
				<% else %>
			        <% @followback = Follow.find(:first, :conditions => ["user_id = ? and follow_id = ?", @current_user.id, follow.user_id]) %>