app/controllers/councils_controller.rb

  def index

    if @current_user.id == 1
      @councils = Council.find(:all, :order => 'councilnumber')
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`councilnumber` = 'localhost:3000' LIMIT 1

  def show
    @council = Council.find(params[:id])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1

  def edit
    @council = Council.find(params[:id])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1