app/controllers/councils_controller.rb

  def index
    @councils = Council.all
---
SELECT `councils`.* FROM `councils`