app/controllers/events_controller.rb

SELECT COUNT(*) FROM `events` WHERE (start_at > '2011-08-14 17:09:33')
SELECT `events`.* FROM `events` WHERE (start_at => '2011-08-14 17:07:39') ORDER BY start_at LIMIT 3 OFFSET 0
---
  def index
    @events = Event.paginate :page => params[:page], :per_page => 10, :order => 'start_at', :conditions => ["start_at > ?", Time.now]

SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def show
    @event = Event.find(params[:id])

SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO `events` (`created_at`, `end_at`, `eventlocation`, `name`, `notes`, `start_at`, `updated_at`, `user_id`) VALUES ('2011-08-20 01:13:30', '2012-08-21 01:13:00', 'loco test ', 'test', 'this is a test', '2012-08-21 01:13:00', '2011-08-20 01:13:30', 1)
---
  def create
    @event = Event.new(params[:event])
    @event.user_id = @current_user.id

    respond_to do |format|
      if @event.save