app/controllers/follows_controller.rb

SELECT `users`.* FROM `users` WHERE (username LIKE 'john') LIMIT 1
SELECT `follows`.* FROM `follows` WHERE (follow_id = 11) ORDER BY updated_at DESC LIMIT 30 OFFSET 0
---
  def index

    @page = params[:page].to_i
    if @page == 0
      @page = 1
    end
    @page = @page + 1


    if params[:user] and isNumeric(params[:user])
      @user = User.find(params[:user])
    else
      # @user = User.find_by_username(params[:user])
      if request.url.index('localhost')
        @user = User.find(:first, :conditions => ['username LIKE ?', params[:user]])
       else
        @user = User.find(:first, :conditions => ['username ILIKE ?', params[:user]])
      end

    end

    if @user
      if params[:view] == 'following'
        # Following
        @follows = Follow.paginate :page => params[:page], :conditions => ["user_id = ?", @user.id], :order => "updated_at DESC"

SELECT `follows`.* FROM `follows` WHERE (user_id = NULL and follow_id = '11') LIMIT 1
INSERT INTO `follows` (`block_id`, `created_at`, `follow_id`, `updated_at`, `user_id`) VALUES (NULL, '2012-08-04 04:03:12', 11, '2012-08-04 04:03:12', 1)
INSERT INTO `activities` (`created_at`, `follow_id`, `message`, `register_id`, `status_id`, `updated_at`, `user_id`) VALUES ('2012-08-04 04:03:12', 1, NULL, NULL, NULL, '2012-08-04 04:03:12', 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `follows` WHERE `follows`.`id` = 5
---
  def create

    # Follow or Unfollow based on status param in AJAX
      @followbutton = params[:id]

   # Check to see if blocked before allowing follow
    @blocker = Follow.find(:first, :conditions => ["user_id = ? and block_id = ?", params[:id], session["user_id"]])

    if @blocker
      @blocked = true

    elsif params[:status] == "follow"
      @follow = Follow.new(params[:follow])
      @follow.user_id = session["user_id"]
      @follow.follow_id = params[:id]
      @follow.save

      # Log follow activitiy
      @activity = Activity.new
      @activity.user_id = session["user_id"]
      @activity.follow_id = @follow.id
      @activity.save

    else # unfollow
      @follow = Follow.find(:first, :conditions => ["user_id = ? and follow_id = ?", session["user_id"], params[:id]])
      if @follow
        @follow.destroy

SELECT `follows`.* FROM `follows` WHERE (user_id = 1 and follow_id = '11') LIMIT 1
DELETE FROM `follows` WHERE `follows`.`id` = 1
INSERT INTO `follows` (`block_id`, `created_at`, `follow_id`, `updated_at`, `user_id`) VALUES (11, '2012-08-04 04:04:22', NULL, '2012-08-04 04:04:22', 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def block

    @block = true
    @followbutton = params[:id]

    # Unfollow before blocking (both parties)
    @unfollow = Follow.find(:first, :conditions => ["user_id = ? and follow_id = ?", session["user_id"], params[:id]])
    if @unfollow
      @unfollow.destroy
    end
    @unfollowee = Follow.find(:first, :conditions => ["user_id = ? and follow_id = ?", params[:id], session["user_id"]])
    if @unfollowee
      @unfollowee.destroy
    end

    # Add user block to follows table
    @follow = Follow.new
    @follow.user_id = session["user_id"]
    @follow.block_id = params[:id]
    @follow.save

    @user = User.find(params[:id])

SELECT `follows`.* FROM `follows` WHERE (user_id = NULL and block_id = '11') LIMIT 1
DELETE FROM `follows` WHERE `follows`.`id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
---
  def unblock

    @unblock = true
    @followbutton = params[:id]

    @follow = Follow.find(:first, :conditions => ["user_id = ? and block_id = ?", session["user_id"], params[:id]])
    if @follow
      @follow.destroy
    end

    @user = User.find(params[:id])