app/controllers/mobile_controller.rb

  def index
  	@councils = Council.find(:all, :conditions => ["councilname <> ''"], :order => 'councilnumber')
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`councilnumber` = 'localhost:3000' LIMIT 1

  def about
	@council = Council.find(session["mobilecouncil"])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1

  def news
	@council = Council.find(session["mobilecouncil"])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1

  def calendar
	@council = Council.find(session["mobilecouncil"])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1