app/controllers/pages_controller.rb

  def index

    if @council
      @post = Post.first :conditions => ["privateflag = ? and council_id = ?", false, @council.id], :order => 'created_at DESC'
      render "index"
    elsif @current_user
      @council = Council.find(@current_user.council_id)
      @post = Post.first :conditions => ["privateflag = ? and council_id = ?", false, @current_user.council_id], :order => 'created_at DESC'
      render "index"
    else
      @councils = Council.find(:all, :conditions => ["councilname <> ''"], :order => 'councilnumber')
---
SELECT `posts`.* FROM `posts` WHERE (privateflag = 0 or privateflag = NULL) ORDER BY created_at DESC LIMIT 1
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1
SELECT `councils`.* FROM `councils` WHERE `councils`.`councilnumber` IS NULL LIMIT 1

  def about
    if @current_user
      @users = User.order("username").where("officer = true and council_id = ?", @current_user.council_id)
---
SELECT `users`.* FROM `users` WHERE (officer = true and council_id = 1) ORDER BY username

  def news
    if !@council
      @council = Council.find(:first, :conditions => ["id = ?", @current_user.council_id])
---
SELECT `councils`.* FROM `councils` WHERE `councils`.`id` = 1 LIMIT 1