app/controllers/password_resets_controller.rb

  def create
    if request.url.index('localhost')
      user = User.find(:first, :conditions => ['username LIKE ?', params[:username].strip])
---
SELECT `users`.* FROM `users` WHERE (username LIKE 'chris') LIMIT 1

  def edit
    @user = User.find_by_password_reset_token!(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'FV-JikZ8UpKOXsGVIts-_g' LIMIT 1

  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => "Password &crarr;
        reset has expired."
    elsif @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'FV-JikZ8UpKOXsGVIts-_g' LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$UDMu7P/g9Ewxl.z8BxW4fOdZBqZAS1lDt85fdgw4LAYC6qaE4l0Bq', `updated_at` = '2012-06-19 20:43:36' WHERE `users`.`id` = 1