app/controllers/posts_controller.rb

  def index
    # @posts = Post.order("created_at DESC")
    # @posts = Post.all :page => params[:page], :order => 'created_at DESC'
    @posts = Post.paginate :page => params[:page], :per_page => 3, :conditions => ['council_id = ?', @council.id], :order => 'created_at DESC'
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` WHERE (council_id = 1) ORDER BY created_at DESC LIMIT 3 OFFSET 0

  def create
    @post = Post.new(params[:post])
    @post.user_id = @current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `postbody`, `postname`, `updated_at`) VALUES ('2011-08-07 18:41:29', 'testing 123\r\n<br/>\r\nnew\r\n<p>ok</p>', 'this is a test', '2011-08-07 18:41:29')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `updated_at` = '2011-08-07 19:08:46', `postbody` = 'testing 123\r\n<br/>\r\nnew\r\n<p>ok</p>\r\n321' WHERE `posts`.`id` = 1

  def destroy
    @post = Post.find(params[:id])
    if @current_user.council_id == @post.council_id or @current_user.admin
      @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2