app/controllers/sessions_controller.rb


      if @authhash[:uid] != '' and @authhash[:provider] != ''

        @auth = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE (username LIKE 'chris') LIMIT 1


        # user = User.find_by_username(params[:username])
        if request.url.index('localhost')
          user = User.find(:first, :conditions => ['username LIKE ?', params[:username].strip])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'chris' LIMIT 1