app/controllers/sponsors_controller.rb

SELECT `sponsors`.* FROM `sponsors` WHERE (council_id = 1) ORDER BY sponsorname
---
  def index
    @sponsors = Sponsor.all

SELECT `sponsors`.* FROM `sponsors` WHERE `sponsors`.`id` = 1 LIMIT 1
---
  def show
    @sponsor = Sponsor.find(params[:id])

SELECT `sponsors`.* FROM `sponsors` WHERE `sponsors`.`id` = 1 LIMIT 1
---
  def edit
    @sponsor = Sponsor.find(params[:id])

INSERT INTO `sponsors` (`council_id`, `created_at`, `description`, `sponsorname`, `updated_at`, `url`) VALUES (1, '2012-07-01 01:54:58', 'pizza', 'nello ', '2012-07-01 01:54:58', 'http://nello.com')
---
  def create
    @sponsor = Sponsor.new(params[:sponsor])

    respond_to do |format|
      if @sponsor.save