app/controllers/statuses_controller.rb

SELECT COUNT(*) FROM `statuses`
SELECT `statuses`.* FROM `statuses` ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def index

    @page = params[:page].to_i
    if @page == 0
      @page = 1
    end
    @page = @page + 1

    # @statuses = Status.find(:all, :order => "created_at DESC")
    @statuses = Status.paginate :page => params[:page], :order => 'created_at DESC' #, :per_page => 3

SELECT `statuses`.* FROM `statuses` WHERE (created_at > '2012-08-04 00:50:43') ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def pollfeed
    @statuses = Status.paginate :page => params[:page], :order => 'created_at DESC', :conditions=>['created_at > ?', Time.now - 10.seconds]

SELECT `users`.* FROM `users` WHERE (username LIKE 'ok1') LIMIT 1
---
  def create

    # API Status Update - Basic Authentication
    if !session["user_id"]
      authenticate_or_request_with_http_basic do |username, password|
        if request.url.index('localhost')
          user = User.find(:first, :conditions => ['username LIKE ?', username.strip])

INSERT INTO `statuses` (`created_at`, `location`, `message`, `mylat`, `mylong`, `updated_at`, `user_id`) VALUES ('2012-08-04 00:57:16', NULL, 'test', NULL, NULL, '2012-08-04 00:57:16', 1)
---
        @status = Status.new
        @status.user_id = session["user_id"]
        @status.message = postmessage
        @status.save

INSERT INTO `activities` (`created_at`, `follow_id`, `message`, `register_id`, `status_id`, `updated_at`, `user_id`) VALUES ('2012-08-04 00:57:16', NULL, NULL, NULL, 1, '2012-08-04 00:57:16', 1)
---
        @activity = Activity.new
        @activity.user_id = session["user_id"]
        @activity.status_id = @status.id
        @activity.save