app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (council_id = 1) ORDER BY username
---
  def index
    respond_to do |format|
      format.html {
        # if @current_user.member
          @users = User.order("username").where("council_id = ?", @current_user.council_id)

SELECT `users`.* FROM `users` WHERE (username LIKE NULL) LIMIT 1
SELECT `follows`.* FROM `follows` WHERE (user_id = 1 and follow_id = 11) LIMIT 1
SELECT COUNT(*) FROM `follows` WHERE (follow_id = 11)
---
  def show
    # @user = User.find(params[:id])
    @page = params[:page].to_i
    if @page == 0
      @page = 1
    end
    @page = @page + 1

    if params[:id] and isNumeric(params[:id])
      @user = User.find(params[:id])
    else

      # @user = User.find_by_username(@callsign)
      if request.url.index('localhost')
        @user = User.find(:first, :conditions => ['username LIKE ?', params[:user]])
       else
        @user = User.find(:first, :conditions => ['username ILIKE ?', params[:user]])
      end


    end

    if @user

      @follow = Follow.find(:first, :conditions => ["user_id = ? and follow_id = ?", session[:user_id], @user.id])
      @block = Follow.find(:first, :conditions => ["user_id = ? and block_id = ?", session[:user_id], @user.id])

      @following = Follow.count(:conditions => ["user_id = ?", @user.id])

SELECT COUNT(*) FROM `activities` WHERE (user_id = 1)
SELECT `activities`.* FROM `activities` WHERE (user_id = 1) ORDER BY activities.updated_at DESC LIMIT 30 OFFSET 0
---

      # # @activities = User.comments.paginate :page => params[:page], :per_page => 3
      # @activities = Comment.paginate :page => params[:page], :conditions => ['user_id = ?', @user.id], :order => 'updated_at DESC'
      @activities = Activity.paginate :page => params[:page], :conditions => ['user_id = ?', @user.id], :order => 'activities.updated_at DESC'

SELECT `users`.* FROM `users` WHERE (username LIKE 'chris') LIMIT 1
---
  def edit

    if @current_user.admin
      if params[:id] and isNumeric(params[:id])
        @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def password
    # if @current_user.admin
    #   @user = User.find(params[:id])
    # else
    #   @user = User.find(@current_user.id)
    # end

    @user = User.find(@current_user.id)

SELECT `councils`.* FROM `councils` WHERE `councils`.`councilnumber` = 'localhost:3000' LIMIT 1
INSERT INTO `users` (`admin`, `auth_token`, `council_id`, `created_at`, `degree`, `email`, `facebook`, `fullname`, `googleplus`, `linkedin`, `member`, `officer`, `officertitle`, `password_digest`, `password_reset_sent_at`, `password_reset_token`, `publisher`, `token`, `twitter`, `updated_at`, `username`) VALUES (NULL, 'iQC9y13G1R6dDGtgcvjsCQ', 1, '2012-06-19 20:52:08', NULL, 'test@numly.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '$2a$10$bYrAtsc/Men4t5t1efrWb.0osSHaPDu6fXGQ.zAO8uUqVgmska4X6', NULL, NULL, NULL, '2348ecc9c6765b1760a3ed5b95c49759', NULL, '2012-06-19 20:52:08', 'test')
---
  def create
    @user = User.new(params[:user])

    # generate API Key
    values = [
            rand(0x0010000),
            rand(0x0010000),
            rand(0x0010000),
            rand(0x0010000),
            rand(0x0010000),
            rand(0x1000000),
            rand(0x1000000),
          ]
    token = "%04x%04x%04x%04x%04x%06x%06x" % values
    if token
      @user.token = token
    end

    if @council
      @user.council_id = @council.id
    else
      @newcouncil = Council.find(:first, :conditions => ['councilnumber = ?', params[:user][:council_id]]) rescue nil
      if @newcouncil.nil?
        @newcouncil = Council.new
        @newcouncil.councilnumber = params[:user][:council_id]
        @newcouncil.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `googleplus` = 'https://plus.google.com/103312078473626397504/posts', `facebook` = 'http://facebook.com/chrismatthieu', `updated_at` = '2011-08-13 16:55:03', `officertitle` = 'webmaster', `member` = 1, `officer` = 1 WHERE `users`.`id` = 1
---
  def update
    if @current_user.admin
      @user = User.find(params[:id])
    else
      @user = User.find(@current_user.id)
    end

    respond_to do |format|
      if @current_user.id == @user.id or (@current_user.admin and (@current_user.council_id == @user.council_id or @current_user == 1))
        if @user.update_attributes(params[:user])

SELECT COUNT(*) FROM `activities`
SELECT `activities`.* FROM `activities` ORDER BY updated_at DESC LIMIT 30 OFFSET 0
---
  def allfeed

    @page = params[:page].to_i
    if @page == 0
      @page = 1
    end
    @page = @page + 1

     respond_to do |format|
       format.html {
         @activities = Activity.paginate :page => params[:page], :order => 'updated_at DESC'

SELECT `activities`.* FROM `activities` WHERE (id = '7')
---
  def showfeed
    # @activities = Activity.find(params[:id])
    @activities = Activity.find(:all, :conditions => ["id = ?", params[:id]])

SELECT `activities`.* FROM `activities` WHERE (created_at > '2012-08-04 01:18:09') ORDER BY activities.updated_at DESC LIMIT 30 OFFSET 0
---
  def pollallfeed
    @activities = Activity.paginate :page => params[:page], :order => 'activities.updated_at DESC', :conditions=>['created_at > ?', Time.now - 10.seconds]

SELECT DISTINCT(activities.id), activities.* FROM `activities` left outer join follows on activities.user_id = follows.follow_id or activities.user_id = 1 WHERE (follows.user_id = 1 or activities.user_id = 1) ORDER BY activities.updated_at DESC LIMIT 30 OFFSET 0
---
  def feed

    @page = params[:page].to_i
    if @page == 0
      @page = 1
    end
    @page = @page + 1


     # @activities = Activity.paginate :page => params[:page], :select => "comments.user_id, comments.verse_id, comments.comment, comments.color, comments.updated_at",
     # :conditions => ["follows.user_id = ? or comments.user_id = ?", @current_user.id, @current_user.id],
     # :joins => "left outer join follows on comments.user_id = follows.follow_id or comments.user_id = #{@current_user.id}",
     # :order => 'comments.updated_at DESC'

     @activities = Activity.paginate :page => params[:page],
     :conditions => ["follows.user_id = ? or activities.user_id = ?", session[:user_id], session[:user_id]],
     :joins => "left outer join follows on activities.user_id = follows.follow_id or activities.user_id = #{session[:user_id]}",
     :order => 'activities.updated_at DESC',
     :select => 'DISTINCT(activities.id), activities.*'

SELECT DISTINCT(activities.id), activities.* FROM `activities` left outer join follows on activities.user_id = follows.follow_id or activities.user_id = 1 WHERE ((follows.user_id = 1 or activities.user_id = 1) and (activities.created_at > '2012-08-04 04:16:02')) ORDER BY activities.updated_at DESC LIMIT 30 OFFSET 0
---
  def pollfeed

     @activities = Activity.paginate :page => params[:page],
     :conditions => ["(follows.user_id = ? or activities.user_id = ?) and (activities.created_at > ?)", session[:user_id], session[:user_id], Time.now - 10.seconds],
     :joins => "left outer join follows on activities.user_id = follows.follow_id or activities.user_id = #{session[:user_id]}",
     :order => 'activities.updated_at DESC',
     :select => 'DISTINCT(activities.id), activities.*'

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `uid` = NULL, `provider` = NULL, `access_token` = NULL, `access_secret` = NULL, `updated_at` = '2012-08-04 04:30:51' WHERE `users`.`id` = 1
---
  def deauthtwitter
    @twitter = User.find(session[:user_id])
    @twitter.uid = nil
    @twitter.provider = nil
    @twitter.access_token = nil
    @twitter.access_secret = nil
    @twitter.save